/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "Introducir credenciales";
"CONNECT_TO_SERVER" = "Conectar al servidor";
"PRINTER_AUTH" = "Autenticación impresora";
"SCREEN_SHARE_AUTH" = "Compartir pantalla";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "Introduzca su nombre y contraseña para conectarse a “%@”.";
"GENERIC_MSG_PASS" = "Introduzca su contraseña para conectarse a “%@”.";
"GENERIC_MSG_NONAME" = "Introduzca su nombre de usuario y su contraseña.";

/* Protocol Specific */
"AFP_MSG" = "Introduzca su nombre y contraseña para el servidor “%@”.";
"SMB_MSG" = "Introduzca su nombre y contraseña para el servidor “%@”.";
"FTP_MSG" = "Introduzca su nombre y contraseña para el servidor “%@”.";
"WEBDAV_MSG" = "Introduzca su nombre y contraseña para el servidor “%@”.";

/* File Server */
"FS_MSG_BOTH" = "Introduzca su nombre y contraseña para el servidor “%@”.";
"FS_MSG_PASS" = "Introduzca su contraseña para el servidor “%@”.";

/* Generic Server */
"SRV_MSG_BOTH" = "Introduzca su nombre y contraseña para el servidor “%@”.";
"SRV_MSG_PASS" = "Introduzca su contraseña para el servidor “%@”.";

/* Printer */
"PRINT_MSG_BOTH" = "Introduzca su nombre y contraseña para la impresora “%@”.";
"PRINT_MSG_PASS" = "Introduzca su contraseña para la impresora “%@”.";

/* Print Server */
"PS_MSG_BOTH" = "Introduzca su nombre de usuario y contraseña para el servidor de impresión “%@”.";
"PS_MSG_PASS" = "Introduzca su nombre de usuario y contraseña para el servidor de impresión “%@”.";

/* Screen Sharing */
"SS_MSG_BOTH" = "Introduzca su nombre y contraseña para compartir la pantalla de “%@”.";
"SS_MSG_PASS" = "Introduzca su contraseña para compartir la pantalla de “%@”.";

"VS_MSG_BOTH" = "Introduzca su nombre y contraseña para ver la pantalla de “%@”.";
"VS_MSG_PASS" = "Introduzca su contraseña para ver la pantalla de “%@”.";

/* Time Machine */
"TM_MSG_BOTH" = "Introduzca su nombre y contraseña para el servidor “%@”, de modo que Time Machine puede acceder a él.";
"TM_MSG_PASS" = "Introduzca su contraseña para el servidor “%@”, de modo que Time Machine puede acceder a él.";

/* Pre Auth */
"PA_MSG_BOTH" = "Introduzca su nombre y contraseña para el servidor proxy “%@”.";
"PA_MSG_PASS" = "Introduzca su contraseña para el servidor proxy “%@”.";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "Conectar";
"SHARE" = "Compartir";
"PRINT" = "Imprimir";
"VIEW" = "Visualización";
"OK" = "Aceptar";

"CONNECT_AS" = "Conectar como:";
"GUEST" = "Invitado";
"REGISTERED_USER" = "Usuario registrado";

"CONNECT_BY" = "Conectar:";
"BY_ASKING_FOR_PERMISSION" = "Solicitando permiso";
"AS_REGISTERED_USER" = "Como usuario registrado";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "Dominio\\Nombre de usuario";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "Seleccione los volúmenes que desea montar en “%@”:";
"SELECT_VOLUME" = "Seleccione los volúmenes que desee montar:";

"SELECT_PRINTER_ON_SERVER" = "Seleccione la impresora en “%@”:";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "Occidental (Mac)";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "Cambie la contraseña de “%1$@” en “%2$@”.";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "Conectando…";
"CONNECTING_TO_HOST" = "Conectando con “%@”.";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "Introduzca la contraseña de “%@” en el servidor de archivos “%@”.";
"ENTER_VOLUME_PASSWORD" = "Introduzca la contraseña para “%@”.";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "Contraseña de la red";
"PRINT_PASSWORD" = "Contraseña de la impresora";
"AFP_PASSWORD" = "Contraseña AFP";
"SMB_PASSWORD" = "Contraseña SMB";
"FTP_PASSWORD" = "Contraseña FTP";
"WEBDAV_PASSWORD" = "Contraseña WebDAV";
"VNC_PASSWORD" = "Contraseña VNC";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "Se ha producido un error.";
"EMSG_INVALID_PWD" = "La contraseña introducida no es válida.";
"EMSG_INVALID_NAME_PWD" = "Ha introducido un nombre de usuario o una contraseña no válidos.";
"EMSG_PWD_EXPIRED" = "Su contraseña ha caducado.";
"EMSG_PWD_NEEDS_CHANGE" = "Debe cambiar su contraseña.";
"EMSG_PWD_POLICY" = "Su contraseña no cumple con los criterios exigidos por el servidor.";
"EMSG_CONNECTION_FAILED" = "Error de conexión";

"EMSG_MOUNT_FAILURE" = "Se ha producido un error al montar un volumen.";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "Inténtelo de nuevo.";
"EINFO_CONTACT_ADMIN" = "Póngase en contacto con el administrador del sistema para obtener más información.";

"EINFO_NO_ACCESS_USER" = "No tiene permiso para acceder al servidor “%@”.";
"EINFO_NO_ACCESS_GUEST" = "El servidor “%@” no permite el acceso como invitado.";
"EINFO_SAME_MACHINE" = "El servidor “%@” está disponible en su ordenador. Acceda a los volúmenes y archivos de forma local.";
"EINFO_NO_SERVER" = "Puede que el servidor “%@” no exista o que no esté disponible en estos instantes. Compruebe el nombre del servidor o la dirección IP, compruebe la conexión de red e inténtelo de nuevo.";
"EINFO_TOO_MANY_USERS" = "El servidor “%@” no permitirá la conexión a ningún usuario más. Intente conectarse de nuevo más tarde.";
"EINFO_GENERAL" = "Se ha producido un error al conectar con el servidor “%@”. Compruebe el nombre del servidor o la dirección IP e inténtelo de nuevo.\n\nSi no puede solucionar el problema, póngase en contacto con el administrador de sistemas.";
"EINFO_NO_SHARES" = "No hay recursos compartidos disponibles o no tiene permiso para acceder a ellas en el servidor “%@”. Póngase en contacto con su administrador para resolver el problema.";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "No tiene permiso para acceder a este servidor.";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "Este servidor no permite el acceso como invitado.";
"EINFO_SAME_MACHINE_UNKNOWN" = "El servidor de archivos está disponible en su ordenador. Acceda a los volúmenes y archivos de forma local.";
"EINFO_NO_SERVER_UNKNOWN" = "Puede que el servidor no exista o que no esté disponible en estos instantes. Compruebe el nombre del servidor o la dirección IP, compruebe la conexión de red e inténtelo de nuevo.";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "Este servidor de archivos no permitirá la conexión a ningún usuario más. Intente conectarse de nuevo más tarde.";
"EINFO_GENERAL_UNKNOWN" = "Se ha producido un error al conectar con el servidor. Compruebe el nombre del servidor o la dirección IP e inténtelo de nuevo.\n\nSi no puede solucionar el problema, contacte con el administrador de sistemas.";
"EINFO_NO_SHARES_UNKNOWN" = "No hay recursos compartidos disponibles o no tiene permiso para acceder a ellas en el servidor. Póngase en contacto con su administrador para resolver el problema.";

"EINFO_UNKNOWN_MOUNT_FAILED" = "Se ha producido un error al montar un volumen.";
"EINFO_ONE_MOUNT_FAILED" = "No se ha podido montar el volumen “%@”.";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "Los siguientes volúmenes no se han podido montar:";
